## Dependencies and Query Engine

In [1]:
import pandas as pd
from sqlalchemy import create_engine

pd.options.display.max_columns = 50

db_con = create_engine(f"postgresql://root:root@localhost:5432/ny_taxi")
db_con.connect()

In [2]:
def sql_query(query, con=db_con):
    return pd.read_sql(query, con=con)

def sql_data_manipulation(query, con=db_con):
    return con.execute(query)

## Query

### Taxi Zones

In [3]:
sql_query(
"""
SELECT * FROM taxi_zone
LIMIT 5
"""
)

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

### Yellow Taxi Trip Data

In [4]:
sql_query(
"""
SELECT * FROM yellow_taxi_data
LIMIT 5
"""
)

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,airport_fee,trip_id,duration
0,1,2021-01-01 00:30:10,2021-01-01 00:36:12,1.0,2.10,1.0,N,142,43,2,8.0,3.0,0.5,0.00,0.0,0.3,11.80,2.5,None,1,6.033333
1,1,2021-01-01 00:51:20,2021-01-01 00:52:19,1.0,0.20,1.0,N,238,151,2,3.0,0.5,0.5,0.00,0.0,0.3,4.30,0.0,None,2,0.983333
2,1,2021-01-01 00:43:30,2021-01-01 01:11:06,1.0,14.70,1.0,N,132,165,1,42.0,0.5,0.5,8.65,0.0,0.3,51.95,0.0,None,3,27.600000
3,1,2021-01-01 00:15:48,2021-01-01 00:31:01,0.0,10.60,1.0,N,138,132,1,29.0,0.5,0.5,6.05,0.0,0.3,36.35,0.0,None,4,15.216667
4,2,2021-01-01 00:31:49,2021-01-01 00:48:21,1.0,4.94,1.0,N,68,33,1,16.5,0.5,0.5,4.06,0.0,0.3,24.36,2.5,None,5,16.533333

### Get pickup location and dropoff location

In [5]:
query = """
SELECT 
    tpep_pickup_datetime, tpep_dropoff_datetime, total_amount,
    CONCAT(zpu."Borough", ' / ', zpu."Zone") AS pickup_location,
    CONCAT(zdo."Borough", ' / ', zdo."Zone") AS dropoff_location
FROM 
    yellow_taxi_data AS t,
    taxi_zone AS zpu,
    taxi_zone AS zdo
WHERE
    t."PULocationID" = zpu."LocationID" AND
    t."DOLocationID" = zdo."LocationID"

LIMIT 5
"""
sql_query(query)

,tpep_pickup_datetime,tpep_dropoff_datetime,total_amount,pickup_location,dropoff_location
0,2021-01-01 00:51:20,2021-01-01 00:52:19,4.30,Manhattan / Upper West Side North,Manhattan / Manhattan Valley
1,2021-01-01 00:43:30,2021-01-01 01:11:06,51.95,Queens / JFK Airport,Brooklyn / Midwood
2,2021-01-01 00:15:48,2021-01-01 00:31:01,36.35,Queens / LaGuardia Airport,Queens / JFK Airport
3,2021-01-01 00:31:49,2021-01-01 00:48:21,24.36,Manhattan / East Chelsea,Brooklyn / Brooklyn Heights
4,2021-01-01 00:16:29,2021-01-01 00:24:30,14.15,Manhattan / Stuy Town/Peter Cooper Village,Manhattan / East Chelsea

#### Implicit join with WHERE

In [6]:
query = """
SELECT 
    tpep_pickup_datetime, tpep_dropoff_datetime, total_amount,
    CONCAT(zpu."Borough", ' / ', zpu."Zone") AS pickup_location,
    CONCAT(zdo."Borough", ' / ', zdo."Zone") AS dropoff_location
FROM 
    yellow_taxi_data AS t,
    taxi_zone AS zpu,
    taxi_zone AS zdo
WHERE
    t."PULocationID" = zpu."LocationID" AND
    t."DOLocationID" = zdo."LocationID"

LIMIT 5
"""
%timeit sql_query(query)

9.17 ms ± 1.11 ms per loop (mean ± std. dev. of 7 runs, 100 loops each)

#### Inner Join

In [7]:
query = """
SELECT 
    tpep_pickup_datetime, tpep_dropoff_datetime, total_amount,
    CONCAT(zpu."Borough", ' / ', zpu."Zone") AS pickup_location,
    CONCAT(zdo."Borough", ' / ', zdo."Zone") AS dropoff_location
FROM 
    yellow_taxi_data AS t 
    JOIN taxi_zone AS zpu
        ON t."PULocationID" = zpu."LocationID"
    JOIN taxi_zone AS zdo
        ON t."DOLocationID" = zdo."LocationID"

LIMIT 5
"""
%timeit sql_query(query)

8.44 ms ± 1.01 ms per loop (mean ± std. dev. of 7 runs, 100 loops each)

### Check if LocationID not in the taxi_zone table

In [8]:
query = """
SELECT 
    "PULocationID", "DOLocationID"
FROM 
    yellow_taxi_data AS t
WHERE
    "PULocationID" NOT IN (SELECT "LocationID" FROM taxi_zone)
    AND 
    "DOLocationID" NOT IN (SELECT "LocationID" FROM taxi_zone)

LIMIT 5
"""
sql_query(query)

   PULocationID  DOLocationID
0           142           142
1           142           142
2           142           142
3           142           142
4           142           142

In [9]:
%timeit sql_query(query)

7.38 ms ± 845 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

All dropoff and pickup locations from yellow_taxi_data table  are in taxi_zone table. To demonstrate the left or right join, one of rows in taxi_zone table will be removed.

In [10]:
query = """
DELETE FROM taxi_zone WHERE "LocationID" = 142
"""
db_con.execute(query)

After removing, re-execute the query to check LocationID

In [11]:
query = """
SELECT 
    tpep_pickup_datetime, tpep_dropoff_datetime, total_amount,
    "PULocationID", "DOLocationID"
FROM 
    yellow_taxi_data AS t
WHERE
    "PULocationID" NOT IN (SELECT "LocationID" FROM taxi_zone)
    OR 
    "DOLocationID" NOT IN (SELECT "LocationID" FROM taxi_zone)

LIMIT 5
"""
sql_query(query)

,tpep_pickup_datetime,tpep_dropoff_datetime,total_amount,PULocationID,DOLocationID
0,2021-01-01 17:58:22,2021-01-01 18:04:44,11.75,142,239
1,2021-01-01 17:20:38,2021-01-01 17:46:18,26.75,142,249
2,2021-01-01 17:25:17,2021-01-01 17:39:20,18.52,263,142
3,2021-01-01 17:22:00,2021-01-01 17:34:39,17.76,142,262
4,2021-01-01 17:21:28,2021-01-01 17:49:06,28.80,116,142

#### Left Join

In [12]:
query = """
SELECT 
    tpep_pickup_datetime, tpep_dropoff_datetime, total_amount,
    CONCAT(zpu."Borough", ' / ', zpu."Zone") AS pickup_location,
    CONCAT(zdo."Borough", ' / ', zdo."Zone") AS dropoff_location
FROM 
    yellow_taxi_data AS t 
    LEFT JOIN taxi_zone AS zpu
        ON t."PULocationID" = zpu."LocationID"
    LEFT JOIN  taxi_zone AS zdo
        ON t."DOLocationID" = zdo."LocationID"

LIMIT 5
"""
sql_query(query)

,tpep_pickup_datetime,tpep_dropoff_datetime,total_amount,pickup_location,dropoff_location
0,2021-01-01 17:30:30,2021-01-01 17:34:43,10.3,Manhattan / Upper West Side South,Unknown / NV
1,2021-01-01 17:46:40,2021-01-01 17:58:06,15.0,Manhattan / Clinton West,Manhattan / Flatiron
2,2021-01-01 17:02:14,2021-01-01 17:10:57,11.3,Manhattan / Morningside Heights,Manhattan / Upper West Side North
3,2021-01-01 17:15:48,2021-01-01 17:31:55,16.8,Manhattan / Upper West Side South,Manhattan / Midtown South
4,2021-01-01 17:34:34,2021-01-01 17:40:07,8.8,Manhattan / Midtown South,Manhattan / Penn Station/Madison Sq West

#### Right Join

In [13]:
query = """
SELECT 
    tpep_pickup_datetime, tpep_dropoff_datetime, total_amount,
    CONCAT(zpu."Borough", ' / ', zpu."Zone") AS pickup_location,
    CONCAT(zdo."Borough", ' / ', zdo."Zone") AS dropoff_location
FROM 
    yellow_taxi_data AS t 
    RIGHT JOIN taxi_zone AS zpu
        ON t."PULocationID" = zpu."LocationID"
    RIGHT JOIN  taxi_zone AS zdo
        ON t."DOLocationID" = zdo."LocationID"

LIMIT 5
"""
sql_query(query)

,tpep_pickup_datetime,tpep_dropoff_datetime,total_amount,pickup_location,dropoff_location
0,2021-01-01 17:30:30,2021-01-01 17:34:43,10.3,Manhattan / Upper West Side South,Unknown / NV
1,2021-01-01 17:46:40,2021-01-01 17:58:06,15.0,Manhattan / Clinton West,Manhattan / Flatiron
2,2021-01-01 17:02:14,2021-01-01 17:10:57,11.3,Manhattan / Morningside Heights,Manhattan / Upper West Side North
3,2021-01-01 17:15:48,2021-01-01 17:31:55,16.8,Manhattan / Upper West Side South,Manhattan / Midtown South
4,2021-01-01 17:34:34,2021-01-01 17:40:07,8.8,Manhattan / Midtown South,Manhattan / Penn Station/Madison Sq West

### Date Function

#### DATE_TRUNC

In [14]:
query = """
SELECT 
    tpep_dropoff_datetime, 
    DATE_TRUNC('DAY', tpep_dropoff_datetime)
FROM 
    yellow_taxi_data AS t 
    
LIMIT 3
"""
sql_query(query)

  tpep_dropoff_datetime date_trunc
0   2021-01-01 17:34:43 2021-01-01
1   2021-01-01 17:58:06 2021-01-01
2   2021-01-01 17:10:57 2021-01-01

#### CAST AS DATE

In [15]:
query = """
SELECT 
    tpep_dropoff_datetime, 
    CAST(tpep_pickup_datetime AS DATE)
FROM 
    yellow_taxi_data AS t 
    
LIMIT 3
"""
sql_query(query)

  tpep_dropoff_datetime tpep_pickup_datetime
0   2021-01-01 17:34:43           2021-01-01
1   2021-01-01 17:58:06           2021-01-01
2   2021-01-01 17:10:57           2021-01-01

### Get the mumber of trip per day

In [16]:
query = """
SELECT 
    CAST(tpep_dropoff_datetime AS DATE) AS "day",
    COUNT(1) AS "count"
FROM 
    yellow_taxi_data AS t 
GROUP BY
    CAST(tpep_dropoff_datetime AS DATE)
ORDER BY
    CAST(tpep_dropoff_datetime AS DATE)

LIMIT 10
"""
sql_query(query)

          day  count
0  2008-12-31      1
1  2009-01-01      3
2  2020-10-13      1
3  2020-12-31      9
4  2021-01-01  24672
5  2021-01-02  34230
6  2021-01-03  26374
7  2021-01-04  44588
8  2021-01-05  46886
9  2021-01-06  49549

**Observations**
* There is a some data quality issue in yellow_taxi_data table. All date must be in range 2021-01-01 to 2021-01-31

### Other aggregation functions

In [17]:
query = """
SELECT 
    CAST(tpep_dropoff_datetime AS DATE) AS "day",
    COUNT(1) AS "count",
    MAX(total_amount) AS "max_total_amount",
    MAX(passenger_count) AS "max_passenger_count"
FROM 
    yellow_taxi_data AS t 
GROUP BY
    CAST(tpep_dropoff_datetime AS DATE)
ORDER BY
    "count" DESC

LIMIT 10
"""
sql_query(query)

          day  count  max_total_amount  max_passenger_count
0  2021-01-28  56385            203.80                  6.0
1  2021-01-29  54601            400.30                  8.0
2  2021-01-22  54225            386.52                  6.0
3  2021-01-21  53246            400.30                  6.0
4  2021-01-14  53019            485.80                  6.0
5  2021-01-15  52977            356.92                  6.0
6  2021-01-27  52676            831.00                  6.0
7  2021-01-13  51294            311.17                  6.0
8  2021-01-19  51120            894.20                  7.0
9  2021-01-08  50467            815.05                  6.0

### Group by multiple fields

In [18]:
query = """
SELECT 
    CAST(tpep_dropoff_datetime AS DATE) AS "day",
    "DOLocationID",
    COUNT(1) AS "count",
    MAX(total_amount) AS "max_total_amount",
    MAX(passenger_count) AS "max_passenger_count"
FROM 
    yellow_taxi_data AS t 
GROUP BY
    1, 2
ORDER BY
    1 DESC, 2 DESC

LIMIT 10
"""
sql_query(query)

          day  DOLocationID  count  max_total_amount  max_passenger_count
0  2021-02-22           170      1             10.56                  1.0
1  2021-02-01           265      3            166.55                  1.0
2  2021-02-01           264      1             19.56                  1.0
3  2021-02-01           263      1             37.92                  2.0
4  2021-02-01           262      2             24.36                  1.0
5  2021-02-01           261      1             70.63                  1.0
6  2021-02-01           255      1             29.80                  1.0
7  2021-02-01           249      3             45.38                  1.0
8  2021-02-01           246      1             57.30                  NaN
9  2021-02-01           244      4             47.19                  6.0

### Filter the duration from 1 to 60 minutes

In [21]:
query = """
SELECT 
    MAX(duration) AS max_duration,
    MIN(duration) AS min_duration
FROM 
    yellow_taxi_data
WHERE
    duration >= 1 AND duration <= 60
    
LIMIT 10
"""
sql_query(query)

   max_duration  min_duration
0          60.0           1.0